Австралия/src/InformationRegisters/Subscriptions/Subscriptions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Subscriptions</name>
  <resources>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>SubscriptionPlan</name>
    <type>
      <types>CatalogRef.SubscriptionPlans</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>EmailTo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Catalogs/Counterparties/Counterparties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Counterparties</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>RetailCustomer</name>
      <description>Retail customer</description>
    </items>
  </predefined>
  <attributes>
    <name>AccessGroup</name>
    <type>
      <types>CatalogRef.CounterpartiesAccessGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovePurchaseOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccountByDefault</name>
    <comment>Bank account by default</comment>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyBankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlowItem</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreditLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvancesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>BasicInformation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CashAssetType</name>
    <type>
      <types>EnumRef.CashAssetTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAcquisitionChannel</name>
    <type>
      <types>CatalogRef.CustomerAcquisitionChannels</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractByDefault</name>
    <comment>Default counterparty contract</comment>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOfBirth</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DefaultDeliveryOption</name>
    <type>
      <types>EnumRef.DeliveryOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DirectDebitMandate</name>
    <type>
      <types>CatalogRef.DirectDebitMandates</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.DiscountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByContracts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoOperationsByOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EORI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Gender</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountCustomerSettlements</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountVendorSettlements</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntityIndividual</name>
    <type>
      <types>EnumRef.CounterpartyType</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalForm</name>
    <type>
      <types>CatalogRef.LegalForms</types>
    </type>
  </attributes>
  <attributes>
    <name>LimitWithoutApproval</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OtherRelationship</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OverdueLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>CatalogRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTermsTemplate</name>
    <type>
      <types>CatalogRef.PaymentTermsTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ProvideEPD</name>
    <type>
      <types>EnumRef.VariantsOfProvidingEPD</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationCountry</name>
    <type>
      <types>CatalogRef.WorldCountries</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesRep</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesTaxRate</name>
    <type>
      <types>CatalogRef.SalesTaxRates</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesTerritory</name>
    <type>
      <types>CatalogRef.SalesTerritories</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Supplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SupplierPriceTypes</name>
    <type>
      <types>CatalogRef.SupplierPriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>TIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackPaymentsByBills</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATTaxation</name>
    <type>
      <types>EnumRef.VATTaxationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvancesGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DoNotShow</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldsValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tags</name>
    <attributes>
      <name>Tag</name>
      <type>
        <types>CatalogRef.Tags</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ActivityTypes</name>
    <attributes>
      <name>ActivityType</name>
      <type>
        <types>CatalogRef.ActivityTypes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>StagesOfPayment</name>
    <attributes>
      <name>Term</name>
      <type>
        <types>EnumRef.PaymentTerm</types>
      </type>
    </attributes>
    <attributes>
      <name>BaselineDate</name>
      <type>
        <types>EnumRef.BaselineDateForPayment</types>
      </type>
    </attributes>
    <attributes>
      <name>DuePeriod</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentPercentage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EarlyPaymentDiscounts</name>
    <attributes>
      <name>Period</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/InformationRegisters/Subscriptions/Forms/RecordForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("SubscriptionPlan") Then
		
		If Record.SubscriptionPlan <> Parameters.SubscriptionPlan Then
			Record.SubscriptionPlan = Parameters.SubscriptionPlan;
		EndIf;
		
		Company = Record.SubscriptionPlan.Company;
		
		Items.SubscriptionPlan.Visible = False;
		
	EndIf;
	
	If Parameters.Property("Counterparty") Then
		
		If Record.Counterparty <> Parameters.Counterparty Then
			Record.Counterparty = Parameters.Counterparty;
		EndIf;
		
		Items.Counterparty.Visible = False;
		
	EndIf;
	
	If Parameters.Property("TypeOfDocument") Then
		
		TypeOfDocument = Parameters.TypeOfDocument;
		
		If TypeOfDocument = "PurchaseOrder"
			Or TypeOfDocument = "SupplierInvoice" Then
		
		
			Items.EmailTo.Visible = False;
		
		EndIf;
		
	EndIf;
	
	If Parameters.Property("StartDate") Then
		
		Record.StartDate = Parameters.StartDate;
		
	EndIf;
	
	If Parameters.Property("EndDate") Then
		
		Record.EndDate = Parameters.EndDate;
		
	EndIf;
	
	If Parameters.Property("IsDimensionsReadOnly") 
		And Parameters.IsDimensionsReadOnly Then
		
		Items.Counterparty.ReadOnly	= True;
		Items.Contract.ReadOnly		= True;
		
	EndIf;
	
	If Parameters.Property("IsResourcesReadOnly") 
		And Parameters.IsResourcesReadOnly Then
		
		Items.StartDate.ReadOnly	= True;
		Items.EndDate.ReadOnly		= True;
		
	EndIf;
	
	SetContractVisible();
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	MessageText = "";
	
	CheckContractToDocumentConditionAccordance(
		MessageText, 
		CurrentObject.Contract,  
		CurrentObject.SubscriptionPlan, 
		CurrentObject.Counterparty, 
		Cancel);	
	
	If MessageText <> "" Then

		If Cancel Then
			MessageText = NStr("en = 'Cannot write the Subscription.'; ru = 'Не удалось записать подписку.';pl = 'Nie można zapisać Subskrypcji';es_ES = 'No se puede escribir la Suscripción.';es_CO = 'No se puede escribir la Suscripción.';tr = 'Abonelik yazılamıyor.';it = 'Impossibile registrare l''Abbonamento.';de = 'Kann das Abonnement nicht schreiben.'") + " " + MessageText;
			CommonClientServer.MessageToUser(MessageText,,"Contract", "Record", Cancel);
		Else
			CommonClientServer.MessageToUser(MessageText);
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure SubscriptionPlanOnChange(Item)
	SubscriptionPlanOnChangeAtServer();
EndProcedure

&AtClient
Procedure CounterpartyStartChoice(Item, ChoiceData, StandardProcessing)
	
	StandardProcessing = False;
	
	If TypeOfDocument = "PurchaseOrder"
		Or TypeOfDocument = "SupplierInvoice" Then
		
		Filter = New Structure("Supplier", True);
		
	Else
		
		Filter = New Structure("Customer", True);
		
	EndIf;	
	
	NotifyDescription = New NotifyDescription("CounterpartyChoiceProcessing", ThisObject);
	
	OpenForm("Catalog.Counterparties.ChoiceForm", New Structure("Filter, ChoiceMode", Filter, True),,,,,NotifyDescription);
	
EndProcedure

&AtClient
Procedure CounterpartyOnChange(Item)
	CounterpartyOnChangeAtServer();
EndProcedure

&AtClient
Procedure ContractStartChoice(Item, ChoiceData, StandardProcessing)
	
	FormParameters = GetChoiceFormParameters(Company, Record.Counterparty, Record.Contract);
	If FormParameters.ControlContractChoice Then
		
		StandardProcessing = False;
		OpenForm("Catalog.CounterpartyContracts.Form.ChoiceForm", FormParameters, Item);
		
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetContractVisible()
	
	If Record.Counterparty.IsEmpty() Then
		DoOperationsByContracts = False;
	Else
		DoOperationsByContracts = Common.ObjectAttributeValue(Record.Counterparty, "DoOperationsByContracts");
	EndIf;
	
	Items.Contract.Visible = DoOperationsByContracts;
	
EndProcedure

&AtServer
Procedure SubscriptionPlanOnChangeAtServer()
	
	Company = Record.SubscriptionPlan.Company;
	
	Record.Contract = ?(DoOperationsByContracts, 
		GetContractByDefault(Company, Record.Counterparty, TypeOfDocument), 
		Catalogs.CounterpartyContracts.EmptyRef());
	
EndProcedure

&AtClient
Procedure CounterpartyChoiceProcessing(Result, Parameters) Export
	
	If Result = Undefined Then
		Return;
	EndIf;
	
	Record.Counterparty = Result;
	CounterpartyOnChangeAtServer();
	
	Modified = True;
	
EndProcedure

&AtServer
Procedure CounterpartyOnChangeAtServer()
	
	SetContractVisible();
	
	Record.Contract = GetContractByDefault(Company, Record.Counterparty, TypeOfDocument);
	
EndProcedure

&AtServerNoContext
Function GetContractByDefault(Company, Counterparty, TypeOfDocument)
	
	If TypeOfDocument = "PurchaseOrder" Then
		Document = Documents.PurchaseOrder.EmptyRef();
	ElsIf TypeOfDocument = "SupplierInvoice" Then
		Document = Documents.SupplierInvoice.EmptyRef();
	Else
		Document = Documents.SalesInvoice.EmptyRef();
	EndIf;
	
	Return DriveServer.GetContractByDefault(Document, Counterparty, Company);
	
EndFunction

&AtServerNoContext
Function GetChoiceFormParameters(Company, Counterparty, Contract)
	
	Document = Documents.SalesInvoice.EmptyRef();
	ContractTypesList = Catalogs.CounterpartyContracts.GetContractTypesListForDocument(Document);
	
	FormParameters = New Structure;
	FormParameters.Insert("ControlContractChoice", Counterparty.DoOperationsByContracts);
	FormParameters.Insert("Counterparty", Counterparty);
	FormParameters.Insert("Company", Company);
	FormParameters.Insert("ContractType", ContractTypesList);
	FormParameters.Insert("CurrentRow", Contract);
	
	Return FormParameters;
	
EndFunction

&AtServerNoContext
Procedure CheckContractToDocumentConditionAccordance(MessageText, Contract, SubscriptionPlan, Counterparty, Cancel)
	
	If Not DriveReUse.CounterpartyContractsControlNeeded()
		OR Not Counterparty.DoOperationsByContracts Then
		Return;
	EndIf;
	
	Document = Documents.SalesInvoice.EmptyRef();
	ManagerOfCatalog = Catalogs.CounterpartyContracts;
	ContractKindsList = ManagerOfCatalog.GetContractTypesListForDocument(Document);
	
	If GetFunctionalOption("CheckContractsOnPosting")
		AND Not ManagerOfCatalog.ContractMeetsDocumentTerms(MessageText, Contract, SubscriptionPlan.Company, Counterparty, ContractKindsList) Then
		Cancel = True;
	EndIf;
	
EndProcedure

#EndRegion
